'''

===================================================================================

Text Game Project (2021.01.30 Developed)

'Text Game Project'(이하 TGP)는 개발자 장승호가 파이썬을 배우고 이틀 밤을 새워 만든 Text RPG Game입니다.

이 버전은 TGP 데모 버전으로, 크게 플레이어, 몬스터, 전투, 휴식 시스템이 구현되어 있습니다.
이를 응용하면 충분히 스토리라인이 있는 RPG 게임을 만들 수 있지만, 이틀 밤을 하얗게 불태운 나머지 더 이상 개발하기가 싫어졌습니다.

압축을 풀면 있는 TGP(○.○ver).exe 파일을 실행하시면 게임을 즐기실 수 있습니다.
게임 방법은 그냥 해보시면 압니다. 그럼 20000

+ 'TGPBGMwav' 폴더를 '로컬 디스크 (C:)' 폴더로 이동하셔야 bgm이 정상적으로 출력됩니다.
+ 'TGPMonster' 폴더를 '로컬 디스크 (C:)' 폴더로 이동하셔야 이미지가 정상적으로 출력됩니다.

===================================================================================

1.1ver 변경 (2021.01.31. Updated)

- 전투 지문의 무작위성 강화
- 포션 드랍 확률 하향
- 전투 상황에서 포션을 여러번 쓸 수 있는 버그 수정
- 코딩 구문 수 대폭 절약
- 직업 소개 추가

*** 직업 밸런스 대폭 조정 알림 (1.2ver 조정 예정)
검사 : 방어력 30, 공격력 100
1. 삼연속 베기 : 3연속 공격, 마나 10
2. 방패 세우기 : 한 전투동안 방어력 20 증가 및 주사위 수정치 -3 (방패 받아치기 사용 시 재사용 가능), 마나 15
 2-1. 대성공 : 주사위 수정치 감소 없음
3. 방패 받아치기 : 일반 공격의 5배 데미지 및 방패 세우기의 효과 삭제, 마나 15
궁수 : 방어력 20, 공격력 100
1. 네 발 끼워쏘기 : 4연속 공격, 마나 15
2. 게릴라전 : 일반 공격의 3배 데미지 및 한 전투동안 주사위 수정치 +3 (누적 가능), 마나 25
3. 기관단총 : 주사위 수정치 -15 판정 성공시 15연속 공격, 마나 75
마법사 : 방어력 5, 공격력 100
1. 마탄 세례 : 5연속 공격, 마나 20
2. 마나 충전 : 한 전투동안 주사위 수정치 +5 (누적 가능), 마나 25
 2-1. 대성공 : 한 전투동안 주사위 수정치 +10 (누적 가능)
3. 아포칼립스 : 주사위 수정치 -25 판정 성공시 적을 소멸, 마나 100

*** bgm 추가
'TGPBGMwav' 폴더를 '로컬 디스크 (C:)' 폴더로 이동하셔야 bgm이 정상적으로 출력됩니다.
1. Moblivion bgm 출처
https://youtu.be/crEc2buSfmo
2. Mrest bgm 출처
스즈미야 하루히의 우울 - 미팅 타임
3. Mnorvous bgm 출처
R. Armando Morabito - Sea of Atlas
4. Mnervous bgm 출처
리그오브레전드 로그인 - 하이 눈 루시안
5. Mnenenervous bgm 출처
리그오브레전드 로그인 - 파이크
6. Mstart bgm 출처
카드캡터 체리 - 크로우리드의 테마

===================================================================================

1.2ver 변경 (2021.02.09. Updated)

- 지문의 가독성 개선
- 포션 드랍 확률 소폭 상향
- 몬스터 무기 이름 수정

*** 몬스터 이미지 추가
'TGPMonster' 폴더를 '로컬 디스크 (C:)' 폴더로 이동하셔야 이미지가 정상적으로 출력됩니다.
*** 직업 밸런스 대폭 조정
*** 상점 추가

===================================================================================

1.3ver 변경 (2021.02.10. Updated)

- 플레이어 데미지 구문 대폭 절약
- 전체적인 구문 정리
- 아포칼립스 변경
변경 전 : 주사위 수정치 -25 판정 성공시 적을 소멸, 마나 100
변경 후 : 주사위 수정치 -25 판정 성공시 10배 데미지 10연속 공격

*** 드래곤 공격 액션 추가
*** 단축키 추가

===================================================================================

1.4ver 변경 (2021.02.11. Updated)

- '다음 단계' 입력 대신 'Enter' 입력 가능
- 몬스터 공격 변경 : 1배 데미지 1연속 공격 > 0.5배 데미지 2연속 공격
- bgm 추가
Mresurrection bgm   출처
Libera - Sanctus

*** 궁수, 마법사 대폭 상향
1. 궁수 :
 방어력 20 > 방어력 25
 게릴라전 : 마나 25 > 마나 15
 기관단총 : 마나 75 > 마나 25
2. 마법사 :
 방어력 5 > 방어력 20
 마나 충전 변경
  변경 전 : 한 전투동안 주사위 수정치 +5 (누적 가능), 마나 25
  변경 후 : 한 전투동안 공격력 25 증가 및 주사위 수정치 +5 (누적 가능), 마나 20
 아포칼립스 : 마나 100 > 마나 50

*** 상점 무기, 방어구 추가
 검사 :
  질 좋은 대검 (50,000원) : 공격력 150
  전설의 판금 갑옷 (100,000원) : 방어력 50
 궁수 :
  마법 활 (75,000원) : 공격력 200, 주사위 수정치 +5
  마법 가죽 갑옷 (75,000원) : 방어력 40, 한 번에 한하여 체력 1로 부활
 마법사 :
  전설의 지팡이 (100,000원) : 공격력 300
  질 좋은 로브 (50,000원) : 방어력 30

===================================================================================

- 지문 소폭 변경
- 마법 가죽 갑옷 변경
 변경 전 : 방어력 40, 한 번에 한하여 체력 1로 부활
 변경 후 : 방어력 40, 남은 부활 횟수 +1
- 아이템 소개 추가
- 부활의 영약 추가
 부활의 영약 (50,000원) : 남은 부활 횟수 +1

***

'''